let countrydataJson = {
    // 英-中
    "nameMapEN": {
        "Liechtenstein": "列支敦士登",
        "Aland": "奥兰群岛",
        "Andorra": "安道尔公国",
        "American Samoa": "东萨摩亚",
        "Antigua and Barb.": "安提瓜和巴布达",
        "Bahrain": "巴林王国",
        "Barbados": "巴巴多斯",
        "Comoros": "科摩罗",
        "Cape Verde": "佛得角",
        "Curaçao": "库拉索",
        "Cayman Is.": "开曼群岛",
        "N. Cyprus": "塞浦路斯",
        "Dominica": "多米尼克",
        "Faeroe Is.": "法罗群岛",
        "Micronesia": "密克罗尼西亚联邦",
        "Grenada": "格林纳达",
        "Guam": "关岛",
        "Isle of Man": "马恩岛",
        "Br. Indian Ocean Ter.": "Br. Indian Ocean Ter.",
        "Jersey": "泽西岛",
        "Siachen Glacier": "锡亚琴冰川",
        "Kiribati": "基里巴斯",
        "Saint Lucia": "圣卢西亚",
        "Malta": "马耳他岛",
        "N. Mariana Is.": "马里亚纳群岛",
        "Montserrat": "蒙特塞拉特",
        "Mauritius": "毛里求斯",
        "Niue": "纽埃",
        "Palau": "帕劳",
        "Palestine": "巴勒斯坦",
        "Fr. Polynesia": "法属波利尼西亚",
        "Singapore": "新加坡",
        "São Tomé and Principe": "São Tomé and Principe",

        "Seychelles": "塞舌尔",
        "Turks and Caicos Is.": "特克斯和凯科斯群岛",
        "Tonga": "汤加",
        "St. Vin. and Gren.": "圣文森特和格林纳丁斯",
        "U.S. Virgin Is.": "圣母玛利亚",
        "St. Pierre and Miquelon": "圣皮埃尔和密克隆群岛",
        "Saint Helena": "圣海伦娜",

        "Afghanistan": "阿富汗",
        "Angola": "安哥拉",
        "Albania": "阿尔巴尼亚",
        "Algeria": "阿尔及利亚",
        "Argentina": "阿根廷",
        "Armenia": "亚美尼亚",
        "Australia": "澳大利亚",
        "Austria": "奥地利",
        "Azerbaijan": "阿塞拜疆",
        "Bahamas": "巴哈马",
        "Bangladesh": "孟加拉国",
        "Belgium": "比利时",
        "Benin": "贝宁",
        "Burkina Faso": "布基纳法索",
        "Burundi": "布隆迪",
        "Bulgaria": "保加利亚",
        "Bosnia and Herz.": "波斯尼亚和黑塞哥维那",
        "Belarus": "白俄罗斯",
        "Belize": "伯利兹",
        "Bermuda": "百慕大群岛",
        "Bolivia": "玻利维亚",
        "Brazil": "巴西",
        "Brunei": "文莱",
        "Bhutan": "不丹",
        "Botswana": "博茨瓦纳",
        "Cambodia": "柬埔寨",
        "Cameroon": "喀麦隆",
        "Canada": "加拿大",
        "Central African Rep.": "中非共和国",
        "Chad": "乍得",
        "Chile": "智利",
        "China": "中国",
        "Colombia": "哥伦比亚",
        "Congo": "刚果",
        "Costa Rica": "哥斯达黎加",
        "Côte d'Ivoire": "科特迪瓦",
        "Croatia": "克罗地亚",
        "Cuba": "古巴",
        "Cyprus": "塞浦路斯",
        "Czech Rep.": "捷克共和国",
        "Dem. Rep. Korea": "韩国",
        "Dem. Rep. Congo": "民主刚果",
        "Denmark": "丹麦",
        "Djibouti": "吉布提",
        "Dominican Rep.": "多米尼加共和国",
        "Ecuador": "厄瓜多尔",
        "Egypt": "埃及",
        "El Salvador": "萨尔瓦多",
        "Eq. Guinea": "赤道几内亚",
        "Eritrea": "厄立特里亚",
        "Estonia": "爱沙尼亚",
        "Ethiopia": "埃塞俄比亚",
        "Falkland Is.": "福克兰群岛",
        "Fiji": "斐济",
        "Finland": "芬兰",
        "France": "法国",
        "French Guiana": "法属圭亚那",
        "Fr. S. Antarctic Lands": "法属南部领地",
        "Gabon": "加蓬",
        "Gambia": "冈比亚",
        "Germany": "德国",
        "Georgia": "佐治亚州",
        "Ghana": "加纳",
        "Greece": "希腊",
        "Greenland": "格陵兰",
        "Guatemala": "危地马拉",
        "Guinea": "几内亚",
        "Guinea-Bissau": "几内亚比绍",
        "Guyana": "圭亚那",
        "Haiti": "海地",
        "Heard I. and McDonald Is.": "赫德岛和麦克唐纳群岛",
        "Honduras": "洪都拉斯",
        "Hungary": "匈牙利",
        "Iceland": "冰岛",
        "India": "印度",
        "Indonesia": "印度尼西亚",
        "Iran": "伊朗",
        "Iraq": "伊拉克",
        "Ireland": "爱尔兰",
        "Israel": "以色列",
        "Italy": "意大利",
        "Ivory Coast": "象牙海岸",
        "Jamaica": "牙买加",
        "Japan": "日本",
        "Jordan": "乔丹",
        "Kashmir": "克什米尔",
        "Kazakhstan": "哈萨克斯坦",
        "Kenya": "肯尼亚",
        "Kosovo": "科索沃",
        "Kuwait": "科威特",
        "Kyrgyzstan": "吉尔吉斯斯坦",
        "Laos": "老挝",
        "Lao PDR": "老挝人民民主共和国",
        "Latvia": "拉脱维亚",
        "Lebanon": "黎巴嫩",
        "Lesotho": "莱索托",
        "Liberia": "利比里亚",
        "Libya": "利比亚",
        "Lithuania": "立陶宛",
        "Luxembourg": "卢森堡",
        "Madagascar": "马达加斯加",
        "Macedonia": "马其顿",
        "Malawi": "马拉维",
        "Malaysia": "马来西亚",
        "Mali": "马里",
        "Mauritania": "毛里塔尼亚",
        "Mexico": "墨西哥",
        "Moldova": "摩尔多瓦",
        "Mongolia": "蒙古",
        "Montenegro": "黑山",
        "Morocco": "摩洛哥",
        "Mozambique": "莫桑比克",
        "Myanmar": "缅甸",
        "Namibia": "纳米比亚",
        "Netherlands": "荷兰",
        "New Caledonia": "新喀里多尼亚",
        "New Zealand": "新西兰",
        "Nepal": "尼泊尔",
        "Nicaragua": "尼加拉瓜",
        "Niger": "尼日尔",
        "Nigeria": "尼日利亚",
        "Korea": "朝鲜",
        "Northern Cyprus": "北塞浦路斯",
        "Norway": "挪威",
        "Oman": "阿曼",
        "Pakistan": "巴基斯坦",
        "Panama": "巴拿马",
        "Papua New Guinea": "巴布亚新几内亚",
        "Paraguay": "巴拉圭",
        "Peru": "秘鲁",
        "Philippines": "菲律宾",
        "Poland": "波兰",
        "Portugal": "葡萄牙",
        "Puerto Rico": "波多黎各",
        "Qatar": "卡塔尔",
        "Romania": "罗马尼亚",
        "Russia": "俄罗斯",
        "Rwanda": "卢旺达",
        "Samoa": "萨摩亚",
        "Saudi Arabia": "沙特阿拉伯",
        "Senegal": "塞内加尔",
        "Serbia": "塞尔维亚",
        "Sierra Leone": "塞拉利昂",
        "Slovakia": "斯洛伐克",
        "Slovenia": "斯洛文尼亚",
        "Solomon Is.": "所罗门群岛",
        "Somaliland": "索马里兰",
        "Somalia": "索马里",
        "South Africa": "南非",
        "S. Geo. and S. Sandw. Is.": "南乔治亚和南桑德威奇群岛",
        "S. Sudan": "南苏丹",
        "Spain": "西班牙",
        "Sri Lanka": "斯里兰卡",
        "Sudan": "苏丹",
        "Suriname": "苏里南",
        "Swaziland": "斯威士兰",
        "Sweden": "瑞典",
        "Switzerland": "瑞士",
        "Syria": "叙利亚",
        "Tajikistan": "塔吉克斯坦",
        "Tanzania": "坦桑尼亚",
        "Thailand": "泰国",
        "The Kingdom of Tonga": "汤加王国",
        "Timor-Leste": "东帝汶",
        "Togo": "多哥",
        "Trinidad and Tobago": "特立尼达和多巴哥",
        "Tunisia": "突尼斯",
        "Turkey": "土耳其",
        "Turkmenistan": "土库曼斯坦",
        "Uganda": "乌干达",
        "Ukraine": "乌克兰",
        "United Arab Emirates": "阿拉伯联合酋长国",
        "United Kingdom": "大不列颠联合王国",
        "United Republic of Tanzania": "坦桑尼亚联合共和国",
        "United States": "美国",
        "United States of America": "美利坚合众国",
        "Uruguay": "乌拉圭",
        "Uzbekistan": "乌兹别克斯坦",
        "Vanuatu": "瓦努阿图",
        "Venezuela": "委内瑞拉",
        "Vietnam": "越南",
        "West Bank": "西岸",
        "W. Sahara": "西撒哈拉",
        "Yemen": "也门",
        "Zambia": "赞比亚",
        "Zimbabwe": "津巴布韦"
    },
    // 英-中心点
    centerMap: {
        "Somalia": {
            "x": 46.393798828125,
            "y": 5.067700195312497
        },
        "Liechtenstein": {
            "x": 9.468558397058674,
            "y": 47.1452333315698
        },
        "Morocco": {
            "x": -7.41718362788174,
            "y": 31.281902981561757
        },
        "W. Sahara": {
            "x": -12.891064453124997,
            "y": 24.31744608684091
        },
        "Serbia": {
            "x": 21.6435546875,
            "y": 43.23959960937502
        },
        "Afghanistan": {
            "x": 67.86733398437501,
            "y": 33.545166015625
        },
        "Angola": {
            "x": 16.774560546875037,
            "y": -12.28891601562502
        },
        "Albania": {
            "x": 20.24335937500001,
            "y": 40.96640625
        },
        "Aland": {
            "x": 20.02934570312506,
            "y": 60.1715087890625
        },
        "Andorra": {
            "x": 1.5941406250000054,
            "y": 42.506689453125
        },
        "United Arab Emirates": {
            "x": 54.36127929687504,
            "y": 24.490136718749966
        },
        "Argentina": {
            "x": -63.1494140625,
            "y": -38.60483398437501
        },
        "Armenia": {
            "x": 44.62685546875002,
            "y": 40.48664550781251
        },
        "American Samoa": {
            "x": -170.6943115234375,
            "y": -14.289453125000005
        },
        "Fr. S. Antarctic Lands": {
            "x": 69.68510742187505,
            "y": -49.450537109375006
        },
        "Antigua and Barb.": {
            "x": -61.83847656249995,
            "y": 17.09113769531251
        },
        "Australia": {
            "x": 128.80693359375007,
            "y": -22.502050781249977
        },
        "Austria": {
            "x": 13.266699218750006,
            "y": 47.8281005859375
        },
        "Azerbaijan": {
            "x": 48.33657226562502,
            "y": 39.7057373046875
        },
        "Burundi": {
            "x": 29.978417968750023,
            "y": -3.4247070312500085
        },
        "Belgium": {
            "x": 4.277929687500017,
            "y": 50.95185546875
        },
        "Benin": {
            "x": 2.6090332031250054,
            "y": 8.95654296875
        },
        "Burkina Faso": {
            "x": -2.653027343749983,
            "y": 12.668749999999996
        },
        "Bangladesh": {
            "x": 90.78115234375005,
            "y": 23.408447265624986
        },
        "Bulgaria": {
            "x": 25.75068359375001,
            "y": 42.5392578125
        },
        "Bahrain": {
            "x": 50.580419921875006,
            "y": 26.023754882812497
        },
        "Bahamas": {
            "x": -76.14807128906249,
            "y": 24.894970703125026
        },
        "Bosnia and Herz.": {
            "x": 17.824365234375037,
            "y": 44.50270996093751
        },
        "Belarus": {
            "x": 27.25605468750001,
            "y": 53.543969726562494
        },
        "Belize": {
            "x": -88.68154296875,
            "y": 17.11970214843751
        },
        "Bermuda": {
            "x": -64.76557617187498,
            "y": 32.327905273437494
        },
        "Bolivia": {
            "x": -64.193017578125,
            "y": -18.306396484375007
        },
        "Brazil": {
            "x": -46.47243652343745,
            "y": -17.756054687499997
        },
        "Barbados": {
            "x": -59.519482421875,
            "y": 13.127441406249993
        },
        "Brunei": {
            "x": 114.529638671875,
            "y": 4.807519531249994
        },
        "Bhutan": {
            "x": 90.249755859375,
            "y": 27.442358398437495
        },
        "Botswana": {
            "x": 22.99931640625,
            "y": -22.32119140625001
        },
        "Central African Rep.": {
            "x": 19.521728515625014,
            "y": 6.594873046874994
        },
        "Canada": {
            "x": -98.48413085937503,
            "y": 56.88569335937511
        },
        "Switzerland": {
            "x": 8.19321289062502,
            "y": 46.5578125
        },
        "Chile": {
            "x": -71.76269531249999,
            "y": -35.07270507812498
        },
        "China": {
            "x": 106.70439453125005,
            "y": 34.78884277343751
        },
        "Côte d'Ivoire": {
            "x": -5.120410156249989,
            "y": 6.916333007812504
        },
        "Cameroon": {
            "x": 12.149316406250009,
            "y": 7.632080078124993
        },
        "Dem. Rep. Congo": {
            "x": 21.60507812500002,
            "y": -1.188134765625
        },
        "Congo": {
            "x": 15.246386718750017,
            "y": -0.6906494140625012
        },
        "Colombia": {
            "x": -75.06088867187496,
            "y": 6.895336914062533
        },
        "Comoros": {
            "x": 43.76132812500006,
            "y": -12.355566406249963
        },
        "Cape Verde": {
            "x": -24.177539062499946,
            "y": 16.532568359375034
        },
        "Costa Rica": {
            "x": -84.6334228515625,
            "y": 10.409838867187496
        },
        "Cuba": {
            "x": -79.52734375,
            "y": 21.074584960937514
        },
        "Curaçao": {
            "x": -68.87309570312499,
            "y": 12.1008056640625
        },
        "Cayman Is.": {
            "x": -81.25595703124995,
            "y": 19.29179687500003
        },
        "N. Cyprus": {
            "x": 33.63437500000002,
            "y": 35.416552734374996
        },
        "Cyprus": {
            "x": 33.22675781250001,
            "y": 34.8973388671875
        },
        "Czech Rep.": {
            "x": 15.621777343750011,
            "y": 49.646923828125
        },
        "Germany": {
            "x": 10.937255859375004,
            "y": 50.66118164062502
        },
        "Djibouti": {
            "x": 42.45747070312501,
            "y": 11.84453125
        },
        "Dominica": {
            "x": -61.326318359374994,
            "y": 15.377001953124996
        },
        "Denmark": {
            "x": 9.640136718750028,
            "y": 56.320166015625006
        },
        "Dominican Rep.": {
            "x": -69.98544921874999,
            "y": 18.192578124999997
        },
        "Algeria": {
            "x": -0.05339355468748863,
            "y": 32.111572265625
        },
        "Ecuador": {
            "x": -77.88151855468749,
            "y": -2.2683105468750284
        },
        "Egypt": {
            "x": 29.58920898437502,
            "y": 26.659228515625
        },
        "Eritrea": {
            "x": 37.56689453125006,
            "y": 16.130957031250013
        },
        "Spain": {
            "x": -2.0973632812499683,
            "y": 39.805297851562486
        },
        "Estonia": {
            "x": 25.95932617187505,
            "y": 58.86762695312497
        },
        "Ethiopia": {
            "x": 42.000097656250006,
            "y": 6.232592773437496
        },
        "Finland": {
            "x": 25.288818359375043,
            "y": 65.1339111328125
        },
        "Fiji": {
            "x": 179.24873046875,
            "y": -16.47041015625001
        },
        "Falkland Is.": {
            "x": -58.72861328125002,
            "y": -51.826171875
        },
        "France": {
            "x": 3.337011718750034,
            "y": 46.01267089843752
        },
        "Faeroe Is.": {
            "x": -6.901611328124957,
            "y": 62.256738281249994
        },
        "Micronesia": {
            "x": 158.23901367187503,
            "y": 6.87617187500004
        },
        "Gabon": {
            "x": 12.655517578125014,
            "y": -1.273046875000006
        },
        "United Kingdom": {
            "x": -3.701391601562463,
            "y": 53.762353515624994
        },
        "Georgia": {
            "x": 43.969970703125014,
            "y": 41.7042236328125
        },
        "Ghana": {
            "x": -1.59130859375,
            "y": 8.102148437499995
        },
        "Guinea": {
            "x": -11.16787109374998,
            "y": 10.72578125
        },
        "Gambia": {
            "x": -15.295019531249991,
            "y": 13.235986328124998
        },
        "Guinea-Bissau": {
            "x": -15.220532226562469,
            "y": 12.514379882812506
        },
        "Eq. Guinea": {
            "x": 10.357324218750037,
            "y": 1.6533447265624945
        },
        "Greece": {
            "x": 24.23686523437506,
            "y": 39.169287109375006
        },
        "Grenada": {
            "x": -61.661279296874994,
            "y": 12.117968749999996
        },
        "Greenland": {
            "x": -42.12436523437496,
            "y": 79.82558593750002
        },
        "Guatemala": {
            "x": -90.69831542968748,
            "y": 16.180126953125
        },
        "Guam": {
            "x": 144.84130859375003,
            "y": 13.414794921875
        },
        "Guyana": {
            "x": -58.447070312499996,
            "y": 3.962353515624997
        },
        "Heard I. and McDonald Is.": {
            "x": 73.54448242187502,
            "y": -53.044287109375006
        },
        "Honduras": {
            "x": -86.36589355468745,
            "y": 14.8280029296875
        },
        "Croatia": {
            "x": 16.383056640625043,
            "y": 45.38457031250003
        },
        "Haiti": {
            "x": -73.1286865234375,
            "y": 19.08408203125
        },
        "Hungary": {
            "x": 19.431103515625008,
            "y": 47.4864501953125
        },
        "Indonesia": {
            "x": 113.91523437500007,
            "y": 0.6022460937500469
        },
        "Isle of Man": {
            "x": -4.605029296874989,
            "y": 54.2401123046875
        },
        "India": {
            "x": null,
            "y": null
        },
        "Br. Indian Ocean Ter.": {
            "x": 72.43735351562502,
            "y": -7.327880859375007
        },
        "Ireland": {
            "x": -8.651367187499957,
            "y": 53.51840820312505
        },
        "Iran": {
            "x": 54.777099609375,
            "y": 33.340087890625014
        },
        "Iraq": {
            "x": 42.70942382812501,
            "y": 33.948876953124994
        },
        "Iceland": {
            "x": -18.822021484374986,
            "y": 65.1913818359375
        },
        "Israel": {
            "x": 35.38671875,
            "y": 31.454541015624997
        },
        "Italy": {
            "x": 10.300097656249994,
            "y": 45.428002929687494
        },
        "Jamaica": {
            "x": -77.344677734375,
            "y": 18.219531249999996
        },
        "Jersey": {
            "x": -2.1272460937499886,
            "y": 49.20380859375
        },
        "Jordan": {
            "x": 36.862158203125006,
            "y": 31.362866210937497
        },
        "Japan": {
            "x": 136.18715820312502,
            "y": 37.69023437499999
        },
        "Siachen Glacier": {
            "x": 77.42402343750001,
            "y": 35.302905273437496
        },
        "Kazakhstan": {
            "x": 69.58466796875007,
            "y": 45.77883300781252
        },
        "Kenya": {
            "x": 37.893603515625045,
            "y": 1.4878417968749884
        },
        "Kyrgyzstan": {
            "x": 74.753515625,
            "y": 40.857421875
        },
        "Cambodia": {
            "x": 105.33613281250001,
            "y": 12.809399414062526
        },
        "Kiribati": {
            "x": -157.45041503906248,
            "y": 1.9353027343750209
        },
        "Korea": {
            "x": 127.45302734375008,
            "y": 36.46884765624999
        },
        "Kuwait": {
            "x": 47.25507812500004,
            "y": 29.53952636718752
        },
        "Lao PDR": {
            "x": 102.74584960937506,
            "y": 19.11528320312499
        },
        "Lebanon": {
            "x": 35.74624023437501,
            "y": 33.87080078125
        },
        "Liberia": {
            "x": -9.889013671874977,
            "y": 7.123364257812497
        },
        "Libya": {
            "x": 17.5671875,
            "y": 28.287646484374996
        },
        "Saint Lucia": {
            "x": -60.9297607421875,
            "y": 13.905468749999994
        },
        "Sri Lanka": {
            "x": 80.40322265625008,
            "y": 7.759765625000014
        },
        "Lesotho": {
            "x": 28.33271484375001,
            "y": -29.684521484375004
        },
        "Lithuania": {
            "x": 23.91464843750005,
            "y": 55.4658203125
        },
        "Luxembourg": {
            "x": 6.138525390625006,
            "y": 49.668383789062496
        },
        "Latvia": {
            "x": 24.437353515625006,
            "y": 56.681689453125
        },
        "Moldova": {
            "x": 28.66894531250001,
            "y": 46.7074951171875
        },
        "Madagascar": {
            "x": 46.621191406250034,
            "y": -18.537646484374978
        },
        "Mexico": {
            "x": -99.31328124999997,
            "y": 22.982104492187545
        },
        "Macedonia": {
            "x": 21.77304687500002,
            "y": 41.460986328124996
        },
        "Mali": {
            "x": -3.637280273437497,
            "y": 15.670703124999996
        },
        "Malta": {
            "x": 14.501318359375006,
            "y": 35.83720703125002
        },
        "Myanmar": {
            "x": 98.31210937500009,
            "y": 19.110424804687483
        },
        "Montenegro": {
            "x": 19.39033203125001,
            "y": 42.69382324218749
        },
        "Mongolia": {
            "x": 105.294189453125,
            "y": 46.173046875
        },
        "N. Mariana Is.": {
            "x": 145.7869140625,
            "y": 15.199267578125003
        },
        "Mozambique": {
            "x": 36.28823242187501,
            "y": -18.651904296875
        },
        "Mauritania": {
            "x": -10.678930664062449,
            "y": 20.41699218750003
        },
        "Montserrat": {
            "x": -62.206494140625,
            "y": 16.751953125
        },
        "Mauritius": {
            "x": 57.48710937500002,
            "y": -20.20878906250001
        },
        "Malawi": {
            "x": 34.69277343750005,
            "y": -13.405078124999996
        },
        "Malaysia": {
            "x": 114.43872070312506,
            "y": 3.513769531250027
        },
        "Namibia": {
            "x": 20.48891601562501,
            "y": -22.879687500000003
        },
        "New Caledonia": {
            "x": 165.93491210937503,
            "y": -21.689990234375003
        },
        "Niger": {
            "x": 7.983154296875,
            "y": 18.019042968749993
        },
        "Nigeria": {
            "x": 8.156396484375037,
            "y": 10.036914062499989
        },
        "Nicaragua": {
            "x": -85.4138427734375,
            "y": 13.979370117187493
        },
        "Niue": {
            "x": -169.8911865234375,
            "y": -19.01943359375001
        },
        "Netherlands": {
            "x": 5.323095703125048,
            "y": 52.41152343750001
        },
        "Norway": {
            "x": 18.325488281250045,
            "y": 64.39902343749999
        },
        "Nepal": {
            "x": 84.09023437500002,
            "y": 28.350390625
        },
        "New Zealand": {
            "x": 170.39785156249997,
            "y": -43.49169921874999
        },
        "Oman": {
            "x": 56.454443359375006,
            "y": 19.578686523437497
        },
        "Pakistan": {
            "x": 67.32825628026447,
            "y": 31.025343602236667
        },
        "Panama": {
            "x": -80.12678222656245,
            "y": 8.36447753906252
        },
        "Peru": {
            "x": -73.01486816406249,
            "y": -8.6458984375
        },
        "Philippines": {
            "x": 121.45131835937502,
            "y": 16.131665039062533
        },
        "Palau": {
            "x": 134.62329101562506,
            "y": 7.547070312499976
        },
        "Papua New Guinea": {
            "x": 144.27143554687507,
            "y": -7.587841796875002
        },
        "Poland": {
            "x": 19.131494140625,
            "y": 52.501220703125
        },
        "Puerto Rico": {
            "x": -66.412841796875,
            "y": 18.187792968750045
        },
        "Dem. Rep. Korea": {
            "x": 127.46562500000002,
            "y": 40.510498046874986
        },
        "Portugal": {
            "x": -7.808032226562474,
            "y": 39.48732910156251
        },
        "Paraguay": {
            "x": -58.392504882812496,
            "y": -23.566113281250004
        },
        "Palestine": {
            "x": 35.21596679687505,
            "y": 31.88183593750003
        },
        "Fr. Polynesia": {
            "x": -149.47905273437493,
            "y": -17.62866210937498
        },
        "Qatar": {
            "x": 51.235693359375006,
            "y": 25.2487548828125
        },
        "Romania": {
            "x": 24.170410156250014,
            "y": 46.4908447265625
        },
        "Russia": {
            "x": 108.31381835937502,
            "y": 57.06738281250004
        },
        "Rwanda": {
            "x": 29.701953125000017,
            "y": -1.851171875000006
        },
        "Saudi Arabia": {
            "x": 48.99257812500002,
            "y": 19.537939453125006
        },
        "Sudan": {
            "x": 30.204345703125014,
            "y": 15.406274414062494
        },
        "S. Sudan": {
            "x": 30.493701171875003,
            "y": 8.430981445312497
        },
        "Senegal": {
            "x": -15.060742187499997,
            "y": 14.207006835937491
        },
        "Singapore": {
            "x": 103.8099609375,
            "y": 1.3284912109374925
        },
        "S. Geo. and S. Sandw. Is.": {
            "x": -36.9080078125,
            "y": -54.38574218750002
        },
        "Saint Helena": {
            "x": -5.745190429687497,
            "y": -15.955078125
        },
        "Solomon Is.": {
            "x": 161.69965820312504,
            "y": -10.390136718750036
        },
        "Sierra Leone": {
            "x": -11.845654296874955,
            "y": 8.682006835937507
        },
        "El Salvador": {
            "x": -88.913330078125,
            "y": 13.788793945312499
        },
        "St. Pierre and Miquelon": {
            "x": -56.37470703124994,
            "y": 46.95920410156252
        },
        "São Tomé and Principe": {
            "x": 6.60332031250006,
            "y": 0.2353515625
        },
        "Suriname": {
            "x": -55.3792724609375,
            "y": 3.92219238281249
        },
        "Slovakia": {
            "x": 19.84301757812501,
            "y": 48.539331054687494
        },
        "Slovenia": {
            "x": 14.93076171875002,
            "y": 46.1870849609375
        },
        "Sweden": {
            "x": 18.26235351562505,
            "y": 61.68288574218754
        },
        "Swaziland": {
            "x": 31.56196289062501,
            "y": -26.56533203125
        },
        "Seychelles": {
            "x": 55.499365234375006,
            "y": -4.6721679687500055
        },
        "Syria": {
            "x": 39.027929687500006,
            "y": 35.0057373046875
        },
        "Turks and Caicos Is.": {
            "x": -72.23989257812498,
            "y": 21.775366210937506
        },
        "Chad": {
            "x": 19.730175781250008,
            "y": 13.510205078124997
        },
        "Togo": {
            "x": 0.818701171875006,
            "y": 8.722924804687494
        },
        "Thailand": {
            "x": 101.12753906250003,
            "y": 13.27260742187503
        },
        "Tajikistan": {
            "x": 71.323388671875,
            "y": 37.76225585937502
        },
        "Turkmenistan": {
            "x": 60.26020507812503,
            "y": 37.665136718750034
        },
        "Timor-Leste": {
            "x": 126.18212890625003,
            "y": -8.968212890624983
        },
        "Tonga": {
            "x": -175.22026367187496,
            "y": -21.117919921874986
        },
        "Trinidad and Tobago": {
            "x": -61.411865234374986,
            "y": 10.454687500000011
        },
        "Tunisia": {
            "x": 10.286328125000034,
            "y": 33.650952148437526
        },
        "Turkey": {
            "x": 35.44365234375002,
            "y": 38.933837890625
        },
        "Tanzania": {
            "x": 34.30610351562507,
            "y": -5.798193359375006
        },
        "Uganda": {
            "x": 31.77651367187501,
            "y": 1.4161621093749945
        },
        "Ukraine": {
            "x": 31.10625000000003,
            "y": 48.991088867187486
        },
        "Uruguay": {
            "x": -56.080957031249994,
            "y": -32.98461914062501
        },
        "United States": {
            "x": -94.22573242187501,
            "y": 40.831396484375006
        },
        "Uzbekistan": {
            "x": 64.55478515625003,
            "y": 41.07536621093752
        },
        "St. Vin. and Gren.": {
            "x": -61.156738281249986,
            "y": 13.258422851562479
        },
        "Venezuela": {
            "x": -64.3777587890625,
            "y": 5.982031250000034
        },
        "U.S. Virgin Is.": {
            "x": -64.73479003906245,
            "y": 17.725952148437514
        },
        "Vietnam": {
            "x": 105.77534179687498,
            "y": 15.688281250000017
        },
        "Vanuatu": {
            "x": 166.916943359375,
            "y": -15.28339843749999
        },
        "Samoa": {
            "x": -172.4345947265625,
            "y": -13.628466796874987
        },
        "Yemen": {
            "x": 47.73261718750004,
            "y": 15.847485351562547
        },
        "South Africa": {
            "x": 24.874755859375043,
            "y": -28.37446289062499
        },
        "Zambia": {
            "x": 27.670996093750002,
            "y": -13.1158203125
        },
        "Zimbabwe": {
            "x": 30.48105468750002,
            "y": -19.133251953125004
        }
    },
    // 中-英
    nameMapCN: {
        "列支敦士登": "Liechtenstein",
        "奥兰群岛": "Aland",
        "安道尔公国": "Andorra",
        "东萨摩亚": "American Samoa",
        "安提瓜和巴布达": "Antigua and Barb.",
        "巴林王国": "Bahrain",
        "巴巴多斯": "Barbados",
        "科摩罗": "Comoros",
        "佛得角": "Cape Verde",
        "库拉索": "Curaçao",
        "开曼群岛": "Cayman Is.",
        "塞浦路斯": "Cyprus",
        "多米尼克": "Dominica",
        "法罗群岛": "Faeroe Is.",
        "密克罗尼西亚联邦": "Micronesia",
        "格林纳达": "Grenada",
        "关岛": "Guam",
        "马恩岛": "Isle of Man",
        "Br. Indian Ocean Ter.": "Br. Indian Ocean Ter.",
        "泽西岛": "Jersey",
        "锡亚琴冰川": "Siachen Glacier",
        "基里巴斯": "Kiribati",
        "圣卢西亚": "Saint Lucia",
        "马耳他岛": "Malta",
        "马里亚纳群岛": "N. Mariana Is.",
        "蒙特塞拉特": "Montserrat",
        "毛里求斯": "Mauritius",
        "纽埃": "Niue",
        "帕劳": "Palau",
        "巴勒斯坦": "Palestine",
        "法属波利尼西亚": "Fr. Polynesia",
        "新加坡": "Singapore",
        "São Tomé and Principe": "São Tomé and Principe",
        "塞舌尔": "Seychelles",
        "特克斯和凯科斯群岛": "Turks and Caicos Is.",
        "汤加": "Tonga",
        "圣文森特和格林纳丁斯": "St. Vin. and Gren.",
        "圣母玛利亚": "U.S. Virgin Is.",
        "圣皮埃尔和密克隆群岛": "St. Pierre and Miquelon",
        "圣海伦娜": "Saint Helena",
        "阿富汗": "Afghanistan",
        "安哥拉": "Angola",
        "阿尔巴尼亚": "Albania",
        "阿尔及利亚": "Algeria",
        "阿根廷": "Argentina",
        "亚美尼亚": "Armenia",
        "澳大利亚": "Australia",
        "奥地利": "Austria",
        "阿塞拜疆": "Azerbaijan",
        "巴哈马": "Bahamas",
        "孟加拉国": "Bangladesh",
        "比利时": "Belgium",
        "贝宁": "Benin",
        "布基纳法索": "Burkina Faso",
        "布隆迪": "Burundi",
        "保加利亚": "Bulgaria",
        "波斯尼亚和黑塞哥维那": "Bosnia and Herz.",
        "白俄罗斯": "Belarus",
        "伯利兹": "Belize",
        "百慕大群岛": "Bermuda",
        "玻利维亚": "Bolivia",
        "巴西": "Brazil",
        "文莱": "Brunei",
        "不丹": "Bhutan",
        "博茨瓦纳": "Botswana",
        "柬埔寨": "Cambodia",
        "喀麦隆": "Cameroon",
        "加拿大": "Canada",
        "中非共和国": "Central African Rep.",
        "乍得": "Chad",
        "智利": "Chile",
        "中国": "China",
        "哥伦比亚": "Colombia",
        "刚果": "Congo",
        "哥斯达黎加": "Costa Rica",
        "科特迪瓦": "Côte d'Ivoire",
        "克罗地亚": "Croatia",
        "古巴": "Cuba",
        "捷克共和国": "Czech Rep.",
        "韩国": "Dem. Rep. Korea",
        "民主刚果": "Dem. Rep. Congo",
        "丹麦": "Denmark",
        "吉布提": "Djibouti",
        "多米尼加共和国": "Dominican Rep.",
        "厄瓜多尔": "Ecuador",
        "埃及": "Egypt",
        "萨尔瓦多": "El Salvador",
        "赤道几内亚": "Eq. Guinea",
        "厄立特里亚": "Eritrea",
        "爱沙尼亚": "Estonia",
        "埃塞俄比亚": "Ethiopia",
        "福克兰群岛": "Falkland Is.",
        "斐济": "Fiji",
        "芬兰": "Finland",
        "法国": "France",
        "法属圭亚那": "French Guiana",
        "法属南部领地": "Fr. S. Antarctic Lands",
        "加蓬": "Gabon",
        "冈比亚": "Gambia",
        "德国": "Germany",
        "佐治亚州": "Georgia",
        "加纳": "Ghana",
        "希腊": "Greece",
        "格陵兰": "Greenland",
        "危地马拉": "Guatemala",
        "几内亚": "Guinea",
        "几内亚比绍": "Guinea-Bissau",
        "圭亚那": "Guyana",
        "海地": "Haiti",
        "赫德岛和麦克唐纳群岛": "Heard I. and McDonald Is.",
        "洪都拉斯": "Honduras",
        "匈牙利": "Hungary",
        "冰岛": "Iceland",
        "印度": "India",
        "印度尼西亚": "Indonesia",
        "伊朗": "Iran",
        "伊拉克": "Iraq",
        "爱尔兰": "Ireland",
        "以色列": "Israel",
        "意大利": "Italy",
        "象牙海岸": "Ivory Coast",
        "牙买加": "Jamaica",
        "日本": "Japan",
        "乔丹": "Jordan",
        "克什米尔": "Kashmir",
        "哈萨克斯坦": "Kazakhstan",
        "肯尼亚": "Kenya",
        "科索沃": "Kosovo",
        "科威特": "Kuwait",
        "吉尔吉斯斯坦": "Kyrgyzstan",
        "老挝": "Laos",
        "老挝人民民主共和国": "Lao PDR",
        "拉脱维亚": "Latvia",
        "黎巴嫩": "Lebanon",
        "莱索托": "Lesotho",
        "利比里亚": "Liberia",
        "利比亚": "Libya",
        "立陶宛": "Lithuania",
        "卢森堡": "Luxembourg",
        "马达加斯加": "Madagascar",
        "马其顿": "Macedonia",
        "马拉维": "Malawi",
        "马来西亚": "Malaysia",
        "马里": "Mali",
        "毛里塔尼亚": "Mauritania",
        "墨西哥": "Mexico",
        "摩尔多瓦": "Moldova",
        "蒙古": "Mongolia",
        "黑山": "Montenegro",
        "摩洛哥": "Morocco",
        "莫桑比克": "Mozambique",
        "缅甸": "Myanmar",
        "纳米比亚": "Namibia",
        "荷兰": "Netherlands",
        "新喀里多尼亚": "New Caledonia",
        "新西兰": "New Zealand",
        "尼泊尔": "Nepal",
        "尼加拉瓜": "Nicaragua",
        "尼日尔": "Niger",
        "尼日利亚": "Nigeria",
        "朝鲜": "Korea",
        "北塞浦路斯": "Northern Cyprus",
        "挪威": "Norway",
        "阿曼": "Oman",
        "巴基斯坦": "Pakistan",
        "巴拿马": "Panama",
        "巴布亚新几内亚": "Papua New Guinea",
        "巴拉圭": "Paraguay",
        "秘鲁": "Peru",
        "菲律宾": "Philippines",
        "波兰": "Poland",
        "葡萄牙": "Portugal",
        "波多黎各": "Puerto Rico",
        "卡塔尔": "Qatar",
        "罗马尼亚": "Romania",
        "俄罗斯": "Russia",
        "卢旺达": "Rwanda",
        "萨摩亚": "Samoa",
        "沙特阿拉伯": "Saudi Arabia",
        "塞内加尔": "Senegal",
        "塞尔维亚": "Serbia",
        "塞拉利昂": "Sierra Leone",
        "斯洛伐克": "Slovakia",
        "斯洛文尼亚": "Slovenia",
        "所罗门群岛": "Solomon Is.",
        "索马里兰": "Somaliland",
        "索马里": "Somalia",
        "南非": "South Africa",
        "南乔治亚和南桑德威奇群岛": "S. Geo. and S. Sandw. Is.",
        "南苏丹": "S. Sudan",
        "西班牙": "Spain",
        "斯里兰卡": "Sri Lanka",
        "苏丹": "Sudan",
        "苏里南": "Suriname",
        "斯威士兰": "Swaziland",
        "瑞典": "Sweden",
        "瑞士": "Switzerland",
        "叙利亚": "Syria",
        "塔吉克斯坦": "Tajikistan",
        "坦桑尼亚": "Tanzania",
        "泰国": "Thailand",
        "汤加王国": "The Kingdom of Tonga",
        "东帝汶": "Timor-Leste",
        "多哥": "Togo",
        "特立尼达和多巴哥": "Trinidad and Tobago",
        "突尼斯": "Tunisia",
        "土耳其": "Turkey",
        "土库曼斯坦": "Turkmenistan",
        "乌干达": "Uganda",
        "乌克兰": "Ukraine",
        "阿拉伯联合酋长国": "United Arab Emirates",
        "大不列颠联合王国": "United Kingdom",
        "坦桑尼亚联合共和国": "United Republic of Tanzania",
        "美国": "United States",
        "美利坚合众国": "United States of America",
        "乌拉圭": "Uruguay",
        "乌兹别克斯坦": "Uzbekistan",
        "瓦努阿图": "Vanuatu",
        "委内瑞拉": "Venezuela",
        "越南": "Vietnam",
        "西岸": "West Bank",
        "西撒哈拉": "W. Sahara",
        "也门": "Yemen",
        "赞比亚": "Zambia",
        "津巴布韦": "Zimbabwe"
    }
}

let mockData = [
    {
    "name": "阿富汗",
    "value": 28397.812
    },
    {
    "name": "安哥拉",
    "value": 19549.124
    },
    {
    "name": "阿尔巴尼亚",
    "value": 3150.143
    },
    {
    "name": "阿尔及利亚",
    "value": 8441.537
    },
    {
    "name": "阿根廷",
    "value": 40374.224
    },
    {
    "name": "亚美尼亚",
    "value": 2963.496
    },
    {
    "name": "澳大利亚",
    "value": 268.065
    },
    {
    "name": "奥地利",
    "value": 22404.488
    },
    {
    "name": "阿塞拜疆",
    "value": 8401.924
    },
    {
    "name": "布隆迪",
    "value": 9094.718
    },
    {
    "name": "比利时",
    "value": 9232.753
    },
    {
    "name": "贝宁",
    "value": 10941.288
    },
    {
    "name": "布基纳法索",
    "value": 9509.798
    },
    {
    "name": "孟加拉国",
    "value": 15540.284
    },
    {
    "name": "保加利亚",
    "value": 151125.475
    },
    {
    "name": "波斯尼亚和黑塞哥维那",
    "value": 7389.175
    },
    {
    "name": "白俄罗斯",
    "value": 66402.316
    },
    {
    "name": "伯利兹",
    "value": 3845.929
    },
    {
    "name": "百慕大群岛",
    "value": 9491.07
    },
    {
    "name": "玻利维亚",
    "value": 308.595
    },
    {
    "name": "巴西",
    "value": 64.951
    },
    {
    "name": "文莱",
    "value": 716.939
    },
    {
    "name": "不丹",
    "value": 195210.154
    },
    {
    "name": "博茨瓦纳",
    "value": 27.223
    },
    {
    "name": "柬埔寨",
    "value": 716.939
    },
    {
    "name": "喀麦隆",
    "value": 1969.341
    },
    {
    "name": "加拿大",
    "value": 4349.921
    },
    {
    "name": "中非共和国",
    "value": 34126.24
    },
    {
    "name": "乍得",
    "value": 7830.534
    },
    {
    "name": "智利",
    "value": 17150.76
    },
    {
    "name": "中国",
    "value": 1359821.465
    },
    {
    "name": "哥伦比亚",
    "value": 60508.978
    },
    {
    "name": "刚果",
    "value": 17150.343
    },
    {
    "name": "科特迪瓦",
    "value": 17150.343
    },
    {
    "name": "哥斯达黎加",
    "value": 20624.343
    },
    {
    "name": "克罗地亚",
    "value": 62191.161
    },
    {
    "name": "古巴",
    "value": 3573.024
    },
    {
    "name": "塞浦路斯",
    "value": 46444.798
    },
    {
    "name": "捷克共和国",
    "value": 4669.685
    },
    {
    "name": "民主刚果",
    "value": 11281.768
    },
    {
    "name": "丹麦",
    "value": 1.468
    },
    {
    "name": "吉布提",
    "value": 1103.685
    },
    {
    "name": "多米尼加共和国",
    "value": 10553.701
    },
    {
    "name": "东帝汶",
    "value": 83017.404
    },
    {
    "name": "厄瓜多尔",
    "value": 834.036
    },
    {
    "name": "埃及",
    "value": 5550.959
    },
    {
    "name": "萨尔瓦多",
    "value": 10016.797
    },
    {
    "name": "赤道几内亚",
    "value": 37062.82
    },
    {
    "name": "厄立特里亚",
    "value": 15001.072
    },
    {
    "name": "爱沙尼亚",
    "value": 78075.705
    },
    {
    "name": "埃塞俄比亚",
    "value": 5741.159
    },
    {
    "name": "福克兰群岛",
    "value": 46182.038
    },
    {
    "name": "斐济",
    "value": 1298.533
    },
    {
    "name": "芬兰",
    "value": 87095.281
    },
    {
    "name": "法国",
    "value": 5367.693
    },
    {
    "name": "法属南部领地",
    "value": 49.581
    },
    {
    "name": "加蓬",
    "value": 63230.866
    },
    {
    "name": "冈比亚",
    "value": 1556.222
    },
    {
    "name": "德国",
    "value": 62066.35
    },
    {
    "name": "佐治亚州",
    "value": 4388.674
    },
    {
    "name": "加纳",
    "value": 24262.901
    },
    {
    "name": "希腊",
    "value": 10876.033
    },
    {
    "name": "格陵兰",
    "value": 1680.64
    },
    {
    "name": "危地马拉",
    "value": 10876.033
    },
    {
    "name": "几内亚",
    "value": 696.167
    },
    {
    "name": "几内亚比绍",
    "value": 11109.999
    },
    {
    "name": "圭亚那",
    "value": 56.546
    },
    {
    "name": "海地",
    "value": 14341.576
    },
    {
    "name": "赫德岛和麦克唐纳群岛",
    "value": 4338.027
    },
    {
    "name": "洪都拉斯",
    "value": 231.169
    },
    {
    "name": "匈牙利",
    "value": 786.126
    },
    {
    "name": "冰岛",
    "value": 7621.204
    },
    {
    "name": "印度",
    "value": 4338.027
    },
    {
    "name": "印度尼西亚",
    "value": 9896.4
    },
    {
    "name": "伊朗",
    "value": 10014.633
    },
    {
    "name": "伊拉克",
    "value": 240676.485
    },
    {
    "name": "爱尔兰",
    "value": 15624.648
    },
    {
    "name": "以色列",
    "value": 4467.561
    },
    {
    "name": "意大利",
    "value": 240676.485
    },
    {
    "name": "牙买加",
    "value": 318.042
    },
    {
    "name": "日本",
    "value": 7420.368
    },
    {
    "name": "乔丹",
    "value": 60508.978
    },
    {
    "name": "哈萨克斯坦",
    "value": 2741.485
    },
    {
    "name": "肯尼亚",
    "value": 6454.554
    },
    {
    "name": "科威特",
    "value": 15921.127
    },
    {
    "name": "吉尔吉斯斯坦",
    "value": 40909.194
    },
    {
    "name": "老挝人民民主共和国",
    "value": 127352.833
    },
    {
    "name": "拉脱维亚",
    "value": 14364.931
    },
    {
    "name": "黎巴嫩",
    "value": 51452.352
    },
    {
    "name": "莱索托",
    "value": 97.743
    },
    {
    "name": "利比里亚",
    "value": 2991.58
    },
    {
    "name": "利比亚",
    "value": 6395.713
    },
    {
    "name": "立陶宛",
    "value": 4341.092
    },
    {
    "name": "卢森堡",
    "value": 3957.99
    },
    {
    "name": "马达加斯加",
    "value": 6040.612
    },
    {
    "name": "马其顿",
    "value": 20758.779
    },
    {
    "name": "马拉维",
    "value": 2008.921
    },
    {
    "name": "马来西亚",
    "value": 3068.457
    },
    {
    "name": "马里",
    "value": 507.885
    },
    {
    "name": "毛里塔尼亚",
    "value": 2090.519
    },
    {
    "name": "墨西哥",
    "value": 31642.36
    },
    {
    "name": "摩尔多瓦",
    "value": 103.619
    },
    {
    "name": "蒙古",
    "value": 21079.532
    },
    {
    "name": "黑山",
    "value": 117886.404
    },
    {
    "name": "摩洛哥",
    "value": 507.885
    },
    {
    "name": "莫桑比克",
    "value": 13985.961
    },
    {
    "name": "缅甸",
    "value": 51931.231
    },
    {
    "name": "纳米比亚",
    "value": 620.078
    },
    {
    "name": "荷兰",
    "value": 2712.738
    },
    {
    "name": "新喀里多尼亚",
    "value": 23967.265
    },
    {
    "name": "新西兰",
    "value": 3609.42
    },
    {
    "name": "尼泊尔",
    "value": 15013.694
    },
    {
    "name": "尼加拉瓜",
    "value": 28275.835
    },
    {
    "name": "尼日尔",
    "value": 2178.967
    },
    {
    "name": "尼日利亚",
    "value": 246.379
    },
    {
    "name": "朝鲜",
    "value": 15893.746
    },
    {
    "name": "挪威",
    "value": 5822.209
    },
    {
    "name": "阿曼",
    "value": 16615.243
    },
    {
    "name": "巴基斯坦",
    "value": 4891.251
    },
    {
    "name": "巴拿马",
    "value": 26846.016
    },
    {
    "name": "巴布亚新几内亚",
    "value": 4368.136
    },
    {
    "name": "巴拉圭",
    "value": 2802.768
    },
    {
    "name": "秘鲁",
    "value": 173149.306
    },
    {
    "name": "菲律宾",
    "value": 29262.83
    },
    {
    "name": "波兰",
    "value": 93444.322
    },
    {
    "name": "葡萄牙",
    "value": 6858.945
    },
    {
    "name": "波多黎各",
    "value": 38198.754
    },
    {
    "name": "卡塔尔",
    "value": 3709.671
    },
    {
    "name": "罗马尼亚",
    "value": 10589.792
    },
    {
    "name": "俄罗斯",
    "value": 6459.721
    },
    {
    "name": "卢旺达",
    "value": 1749.713
    },
    {
    "name": "萨摩亚",
    "value": 11749.713
    },
    {
    "name": "沙特阿拉伯",
    "value": 21861.476
    },
    {
    "name": "塞内加尔",
    "value": 21861.476
    },
    {
    "name": "塞尔维亚",
    "value": 18862.257
    },
    {
    "name": "塞拉利昂",
    "value": 10836.732
    },
    {
    "name": "斯洛伐克",
    "value": 514.648
    },
    {
    "name": "斯洛文尼亚",
    "value": 27258.387
    },
    {
    "name": "所罗门群岛",
    "value": 35652.002
    },
    {
    "name": "索马里",
    "value": 12950.564
    },
    {
    "name": "南非",
    "value": 526.447
    },
    {
    "name": "南乔治亚和南桑德威奇群岛",
    "value": 6218.195
    },
    {
    "name": "韩国",
    "value": 5751.976
    },
    {
    "name": "南苏丹",
    "value": 6218.195
    },
    {
    "name": "西班牙",
    "value": 9636.173
    },
    {
    "name": "斯里兰卡",
    "value": 9636.173
    },
    {
    "name": "苏丹",
    "value": 3573.024
    },
    {
    "name": "苏里南",
    "value": 524.96
    },
    {
    "name": "斯威士兰",
    "value": 5433.437
    },
    {
    "name": "瑞典",
    "value": 2054.232
    },
    {
    "name": "瑞士",
    "value": 9382.297
    },
    {
    "name": "叙利亚",
    "value": 1193.148
    },
    {
    "name": "塔吉克斯坦",
    "value": 7830.534
    },
    {
    "name": "坦桑尼亚",
    "value": 9876.785
    },
    {
    "name": "泰国",
    "value": 11720.781
    },
    {
    "name": "巴哈马",
    "value": 6306.014
    },
    {
    "name": "多哥",
    "value": 66402.316
    },
    {
    "name": "特立尼达和多巴哥",
    "value": 7627.326
    },
    {
    "name": "突尼斯",
    "value": 5041.995
    },
    {
    "name": "土耳其",
    "value": 10016.797
    },
    {
    "name": "土库曼斯坦",
    "value": 1328.095
    },
    {
    "name": "乌干达",
    "value": 10631.83
    },
    {
    "name": "乌克兰",
    "value": 72137.546
    },
    {
    "name": "阿拉伯联合酋长国",
    "value": 44973.33
    },
    {
    "name": "大不列颠联合王国",
    "value": 33987.213
    },
    {
    "name": "美国",
    "value": 3371.982
    },
    {
    "name": "乌拉圭",
    "value": 27769.27
    },
    {
    "name": "乌兹别克斯坦",
    "value": 236.299
    },
    {
    "name": "瓦努阿图",
    "value": 89047.397
    },
    {
    "name": "委内瑞拉",
    "value": 236.299
    },
    {
    "name": "越南",
    "value": 13.565
    },
    {
    "name": "西撒哈拉",
    "value": 51452.352
    },
    {
    "name": "也门",
    "value": 13216.985
    },
    {
    "name": "赞比亚",
    "value": 13076.978
    },
    {
    "name": "津巴布韦",
    "value": 11056.426
    }
]
  